Tekla Open API Reference for Tekla Structures 2025
Enum<E> Properties
The Enum<E> generic type exposes the following members.
Properties
Name | Description
Value
Gets or sets the value.
Top
See Also
Reference
Enum<E> Structure
Tekla.Structures.Datatype Namespace